tap "homebrew/bundle"
brew "automake"
brew "bat"
brew "cmake"
brew "coreutils"
brew "findutils"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "grep"
brew "gron"
brew "jq"
brew "moreutils"
brew "neovim"
brew "openssh"
brew "ripgrep"
brew "rust"
brew "wget"
brew "zsh"
cask "1password"
cask "iterm2"
cask "slack"
cask "spotify"
cask "obsidian"
