cask_args appdir: "/Applications"

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'ack'
brew 'git'
brew 'hub'
brew 'jq'
brew 'tree'
brew 'rename'
brew 'tmux'
brew 'vim'
brew 'wget'

# Apps
cask '1password'
cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'macvim'
cask 'iterm2'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'vlc'

# Fonts
cask 'font-hack'
cask 'font-source-code-pro'
